---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.IndexTriangle.#ctor(System.Int32,System.Int32,System.Int32)
source: html/38f533c0-6983-5ae9-2a2d-a5edd8b2fdcd.htm
---
# Autodesk.Revit.DB.DirectContext3D.IndexTriangle.#ctor Method

Constructs the triangle primitive.

## Syntax (C#)
```csharp
public IndexTriangle(
	int index0,
	int index1,
	int index2
)
```

## Parameters
- **index0** (`System.Int32`) - The index of the triangle's first vertex.
- **index1** (`System.Int32`) - The index of the triangle's second vertex.
- **index2** (`System.Int32`) - The index of the triangle's third vertex.